scripts/stress_test_webhook.yml
config:
  target: "http://127.0.0.1:54321/functions/v1/whatsapp-bot"
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 50
      name: "Rampa agresiva"
    - duration: 60
      arrivalRate: 50
      name: "Estrés sostenido (Bombardeo Total)"

  variables:
    rep_phone: "5219601725763"
    admin_phone: "5219631539156"
    client_phones:
      - "5219631601852"
      - "5219631890474"

scenarios:
  - name: "S1: Repartidor Normal (Consulta de Estado)"
    weight: 4
    flow:
      - post:
          url: "/"
          headers:
            Content-Type: "application/json"
          json:
            object: "whatsapp_business_account"
            entry:
              - id: "123456789"
                changes:
                  - value:
                      messaging_product: "whatsapp"
                      metadata:
                        display_phone_number: "5219630000000"
                        phone_number_id: "987654321"
                      contacts:
                        - profile: { name: "Repartidor" }
                          wa_id: "{{ rep_phone }}"
                      messages:
                        - from: "{{ rep_phone }}"
                          id: "wamid.s1_{{ $randomString() }}"
                          timestamp: "{{ $timestamp }}"
                          text:
                            body: "Acabo de entregar el pedido. ¿Cuál es mi estado?"
                          type: "text"
                    field: "messages"

  - name: "S2: Admin (Comandos Complejos)"
    weight: 2
    flow:
      - post:
          url: "/"
          headers:
            Content-Type: "application/json"
          json:
            object: "whatsapp_business_account"
            entry:
              - id: "123456789"
                changes:
                  - value:
                      messaging_product: "whatsapp"
                      metadata:
                        display_phone_number: "5219630000000"
                        phone_number_id: "987654321"
                      contacts:
                        - profile: { name: "Admin" }
                          wa_id: "{{ admin_phone }}"
                      messages:
                        - from: "{{ admin_phone }}"
                          id: "wamid.s2_{{ $randomString() }}"
                          timestamp: "{{ $timestamp }}"
                          text:
                            body: "/puntos 9631234567 500"
                          type: "text"
                    field: "messages"

  - name: "S3: Caos (Mensajes Vacíos y Rotos)"
    weight: 1
    flow:
      - post:
          url: "/"
          headers:
            Content-Type: "application/json"
          json:
            object: "whatsapp_business_account"
            entry:
              - id: "123456789"
                changes:
                  - value:
                      messaging_product: "whatsapp"
                      metadata:
                        display_phone_number: "5219630000000"
                        phone_number_id: "987654321"
                      contacts:
                        - profile: { name: "Caos" }
                          wa_id: "{{ rep_phone }}"
                      messages:
                        - from: "{{ rep_phone }}"
                          id: "wamid.s3_{{ $randomString() }}"
                          timestamp: "{{ $timestamp }}"
                          # Tipo de mensaje no soportado (audio) sin texto
                          type: "audio"
                          audio:
                            id: "audio_1234"
                    field: "messages"

  - name: "S4: Texto Gigante (Desbordamiento de Buffer)"
    weight: 1
    flow:
      - post:
          url: "/"
          headers:
            Content-Type: "application/json"
          json:
            object: "whatsapp_business_account"
            entry:
              - id: "123456789"
                changes:
                  - value:
                      messaging_product: "whatsapp"
                      metadata:
                        display_phone_number: "5219630000000"
                        phone_number_id: "987654321"
                      contacts:
                        - profile: { name: "Hacker" }
                          wa_id: "{{ admin_phone }}"
                      messages:
                        - from: "{{ admin_phone }}"
                          id: "wamid.s4_{{ $randomString() }}"
                          timestamp: "{{ $timestamp }}"
                          text:
                            # 2000 repeticiones de la palabra "crash "
                            body: "crash {{ $randomString() }} {{ $randomString() }} {{ $randomString() }} {{ $randomString() }} {{ $randomString() }}"
                          type: "text"
                    field: "messages"

  - name: "S5: Ataque de Idempotencia (Doble Envío Exacto)"
    weight: 2
    # Simulamos que Meta se trabó y envió el EXACTO mismo webhook 2 veces al mismo tiempo
    flow:
      - loop:
          - post:
              url: "/"
              headers:
                Content-Type: "application/json"
              json:
                object: "whatsapp_business_account"
                entry:
                  - id: "123456789"
                    changes:
                      - value:
                          messaging_product: "whatsapp"
                          metadata:
                            display_phone_number: "5219630000000"
                            phone_number_id: "987654321"
                          contacts:
                            - profile: { name: "Admin" }
                              wa_id: "{{ admin_phone }}"
                          messages:
                            - from: "{{ admin_phone }}"
                              # IMPORTANTE: ID Estático para simular duplicidad
                              id: "wamid.static_duplicate_attack_001"
                              timestamp: "1234567890"
                              text:
                                body: "Crear pedido urgente."
                              type: "text"
                        field: "messages"
        count: 2

  - name: "S6: Creación Masiva de Pedidos"
    weight: 4
    flow:
      - post:
          url: "/"
          headers:
            Content-Type: "application/json"
          json:
            object: "whatsapp_business_account"
            entry:
              - id: "123456789"
                changes:
                  - value:
                      messaging_product: "whatsapp"
                      metadata:
                        display_phone_number: "5219630000000"
                        phone_number_id: "987654321"
                      contacts:
                        - profile: { name: "Restaurante" }
                          wa_id: "{{ admin_phone }}"
                      messages:
                        - from: "{{ admin_phone }}"
                          id: "wamid.s6_{{ $randomString() }}"
                          timestamp: "{{ $timestamp }}"
                          text:
                            # Se simula al restaurante enviando un pedido para los clientes que indicaste
                            body: "Manda repartidor a la central. Pedido de 2 pizzas grandes para el cliente {{ $randomOf(client_phones) }}."
                          type: "text"
                    field: "messages"